Repository: AvidlyWordPress/seminar-sessions
Catalog: languages/seminar-sessions-*.po
Languages: fi

source: Presented by %s
fi: Puhuja: %s

source: %s Track
fi: Lava: %s

source: Your Sponsors
fi: Sponsorisi

source: Sponsors
fi: Sponsorit

source: Title:
fi: Otsikko:

source: Your Speakers
fi: Esiintyjäsi

source: Speakers
fi: Esiintyjät

source: View all speakers &rarr;
fi: Näytä kaikki esiintyjät &rarr;

source: Number of speakers to show:
fi: Listaa kerralla näin monta esiintyjää:

source: Display in random order
fi: Näytä satunnaisessa järjestyksessä

source: Show off your sessions
fi: Tee nosto yhdestä esityksestä

source: Sessions
fi: Esitykset

source: View all sessions &rarr;
fi: Näytä kaikki esitykset &rarr;

source: Display your organizing team in the sidebar
fi: Näytä järjestäjätiimi sivupalkissa

source: Organizers
fi: Järjestäjät

source: Organizing team &rarr;
fi: Järjestäjätiimi &rarr;

source: Number of organizers to show:
fi: Näytettävien järjestäjien lkm:

source: Order Sponsor Levels
fi: Järjestä sponsoritasot

source: Options saved
fi: Asetukset tallennettu

source: Change the order of sponsor levels are displayed in the sponsors page template.
fi: Muuta sponsoritasojen järjestystä

source: Save Options
fi: Tallenna asetukset

source: Time
fi: Aika

source: Presented by %1$s in %2$s.
fi: Esiintyjä %1$s lavalla %2$s.

source: Presented by %s.
fi: Esiintyjä %s.

source: Presented in %s.
fi: Lava %s.

source: Slides
fi: Diat

source: Speaker
fi: Esiintyjä

source: Session
fi: Esitys

source: Session time
fi: Esityksen aika

source: Session Info
fi: Esityksen tiedot

source: Sponsor Info
fi: Sponsorin tiedot

source: A speaker entry must exist first. Separate multiple speakers with commas.
fi: Esiintyjä on tallennettava ensin. Erottele useammat esiintyjät pilkulla.

source: Date:
fi: Pvm:

source: Time:
fi: Kellonaika:

source: Session Start Hour
fi: Esityksen alkamisaika (tunnit)

source: Session Start Minutes
fi: Esityksen alkamisaika (minuutit)

source: Session Meridiem
fi: Aamu/iltapäivä

source: Type:
fi: Tyyppi:

source: Regular Session
fi: Esitys

source: Break, Lunch, etc.
fi: Tauko, lounas, jne.

source: Slides URL:
fi: Diojen URL:

source: Add New
fi: Lisää uusi

source: Create New Speaker
fi: Lisää uusi esiintyjä

source: Edit
fi: Muokkaa

source: Edit Speaker
fi: Muokkaa esiintyjää

source: New Speaker
fi: Uusi esiintyjä

source: View Speaker
fi: Näytä esiintyjä

source: Search Speakers
fi: Hae esiintyjiä

source: No speakers found
fi: Esiintyjiä ei löytynyt

source: No speakers found in Trash
fi: Esiintyjiä ei löytynyt roskakorista

source: Speaker Photo
fi: Esiintyjän kuva

source: Set Speaker Photo
fi: Aseta esiintyjän kuva

source: Use Speaker Photo
fi: Käytä esiintyjän kuvana

source: Remove Speaker Photo
fi: Poista esiintyjän kuva

source: Create New Session
fi: Lisää uusi esitys

source: Edit Session
fi: Muokkaa esitystä

source: New Session
fi: Uusi esitys

source: View Session
fi: Näytä esitys

source: Search Sessions
fi: Hae esityksiä

source: No sessions found
fi: Esityksiä ei löytynyt

source: No sessions found in Trash
fi: Esityksiä ei löytynyt roskakorista

source: Session Photo
fi: Esityksen kuva

source: Set Session Photo
fi: Aseta esityksen kuva

source: Use Session Photo
fi: Käytä esityksen kuvana

source: Remove Session Photo
fi: Poista esityksen kuva

source: Sponsor
fi: Sponsori

source: Create New Sponsor
fi: Luo uusi sponsori

source: Edit Sponsor
fi: Muokkaa sponsoria

source: New Sponsor
fi: Uusi sponsori

source: View Sponsor
fi: Näytä sponsori

source: Search Sponsors
fi: Hae sponsoreita

source: No sponsors found
fi: Sponsoreita ei löytynyt

source: No sponsors found in Trash
fi: Sponsoreita ei löytynyt roskakorista

source: Sponsor logo
fi: Sponsorin logo

source: Set Sponsor logo
fi: Aseta sponsorin logo

source: Use Sponsor logo
fi: Käytä sponsorin logona

source: Remove Sponsor logo
fi: Poista sponsorin logo

source: Organizer
fi: Järjestäjä

source: Create New Organizer
fi: Luo uusi järjestäjä

source: Edit Organizer
fi: Muokkaa järjestäjän tietoja

source: New Organizer
fi: Uusi järjestäjä

source: View Organizer
fi: Näytä järjestäjä

source: Search Organizers
fi: Hae järjestäjiä

source: No organizers found
fi: Järjestäjiä ei löytynyt

source: No organizers found in Trash
fi: Järjestäjiä ei löytynyt roskakorista

source: Organizer logo
fi: Järjestäjän logo

source: Set Organizer logo
fi: Aseta järjestäjän logo

source: Use Organizer logo
fi: Käytä järjestäjän logona

source: Remove Organizer logo
fi: Poista järjestäjän logo

source: Tracks
fi: Lavat

source: Track
fi: Lava

source: Search Tracks
fi: Hae lavoja

source: Popular Tracks
fi: Suositut lavat

source: All Tracks
fi: Kaikki lavat

source: Edit Track
fi: Muokkaa lavaa

source: Update Track
fi: Päivitä lava

source: Add Track
fi: Lisää lava

source: New Track
fi: Uusi lava

source: Sponsor Levels
fi: Sponsoritasot

source: Sponsor Level
fi: Sponsoritaso

source: Search Sponsor Levels
fi: Hae sponsoritasoja

source: Popular Sponsor Levels
fi: Suositut sponsoritasot

source: All Sponsor Levels
fi: Kaikki sponsoritasot

source: Edit Sponsor Level
fi: Muokkaa sponsoritasoa

source: Update Sponsor Level
fi: Päivitä sponsoritaso

source: Add Sponsor Level
fi: Lisää sponsoritaso

source: New Sponsor Level
fi: Uusi sponsoritaso

source: Avatar
fi: Kuva

source: %s Speaker
fi: %s esiintyjä

source: %s Session
fi: %s esitys

source: %s Sponsor
fi: %s sponsori

source: Contact Information
fi: Yhteystiedot

source: Company Name:
fi: Yritys:

source: Website:
fi: WWW-sivut:

source: First Name:
fi: Etunimi:

source: Last Name:
fi: Sukunimi:

source: Email Address:
fi: Sähköposti:

source: Phone Number:
fi: Puhelinnumero

source: Address
fi: Osoite

source: Street Address 1:
fi: Katuosoite 1:

source: Street Address 2:
fi: Katuosoite 2:

source: City:
fi: Kaupunki:

source: State / Province:
fi: Osavaltio / maakunta:

source: ZIP / Postal Code:
fi: Postinumero:

source: Country:
fi: Maa:

source: Seminar Sessions
fi: Seminaariohjelma

source: Manage Sessions, Speakers, Sponsors and display Schedules for a seminar-type event. Based almost entirely on code
fi: Hallinnoi esityksiä, esiintyjiä, sponsoreita ja näytä sivustolla seminaarin ohjelma.
